{
  "_metadata": {
    "id": "TEA03",
    "title": "Restrict Lobby Bypass to Internal Users Only",
    "description": "Configures the Global Teams meeting policy so only users within the same organization (excluding guests) can bypass the meeting lobby. All external users, guest accounts, and federated users must wait in the lobby. This is the most restrictive lobby setting that still allows internal users to join seamlessly.",
    "frameworks": [
      "CIS Microsoft 365 v3.1.0",
      "NIST SP 800-53 Rev 5",
      "NIS2",
      "DORA",
      "ISO 27001:2022",
      "UK NCSC CAF v3.2",
      "SOC 2",
      "PCI DSS v4.0",
      "HIPAA",
      "FedRAMP Moderate",
      "GDPR (EU) 2016/679",
      "CMMC v2.0",
      "HITRUST CSF v11",
      "Microsoft Cloud Security Benchmark"
    ],
    "cisChecks": ["8.1.2", "8.5.3"],
    "severity": "High",
    "category": "Microsoft Teams",
    "deploymentOrder": 3,
    "requiredLicence": "Microsoft Teams (included with Microsoft 365)",
    "version": "2.0",
    "lastUpdated": "2026-02-27",
    "_notes": "This policy complements TEA02 by reinforcing the same setting. EveryoneInCompanyExcludingGuests is the recommended CIS value. Other options: EveryoneInCompany (includes guests), EveryoneInSameAndFederatedCompany (includes federated), Everyone (no lobby), OrganizerOnly (most restrictive - only organizer bypasses). For maximum security, use OrganizerOnly, but this impacts internal user experience."
  },
  "cmdlet": "Set-CsTeamsMeetingPolicy",
  "parameters": {
    "Identity": "Global",
    "AutoAdmittedUsers": "EveryoneInCompanyExcludingGuests"
  },
  "postDeployment": [
    "Get-CsTeamsMeetingPolicy -Identity Global | Select-Object AutoAdmittedUsers",
    "Verify internal users can join meetings directly without waiting in the lobby",
    "Verify guest users are held in the lobby until admitted",
    "Verify federated users (from other M365 tenants) are held in the lobby",
    "For even stricter control, consider OrganizerOnly which requires the organizer to admit all participants"
  ]
}
