{
  "displayName": "CA04 | Block High-Risk Sign-Ins",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "excludeGroups": []
    },
    "applications": {
      "includeApplications": [
        "All"
      ]
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "signInRiskLevels": [
      "high"
    ]
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ]
  },
  "_metadata": {
    "policyNumber": "CA04",
    "description": "Blocks sign-in attempts that Microsoft Entra ID Identity Protection classifies as high risk in real time. High-risk detections include sign-ins from anonymous IP addresses, malware-linked IP addresses, impossible travel, token anomalies, and password spray patterns.",
    "cisControls": [
      "CIS 1.2.2 - Ensure that a user risk policy is configured to block high-risk users",
      "CIS 5.2.2.5 - Ensure Sign-in risk policy is configured to require MFA for medium and high sign-in risk"
    ],
    "frameworkMappings": {
      "NIST-800-53": [
        "SI-4",
        "AC-7",
        "IA-5(13)",
        "RA-5"
      ],
      "CIS-Microsoft-365": [
        "1.2.2",
        "5.2.2.5"
      ],
      "ISO-27001-2022": [
        "A.8.16 - Monitoring activities"
      ],
      "MITRE-ATT&CK": [
        "T1078 - Valid Accounts",
        "T1110 - Brute Force",
        "T1090 - Proxy"
      ],
      "NIS2": [
        "Article 21(2)(b) - Incident handling"
      ],
      "Essential-Eight": [
        "Multi-factor authentication"
      ]
    },
    "requiredLicenses": [
      "Microsoft Entra ID P2 or Microsoft 365 E5"
    ],
    "deploymentNotes": "Requires Entra ID P2 licensing for Identity Protection real-time risk detection. Deploy in report-only first and monitor the Risky sign-ins report (Entra > Protection > Identity Protection > Risky sign-ins) for false positives before enforcing. Replace  with the Object ID of your break-glass exclusion security group."
  },
  "_configFields": [
    {
      "id": "caState",
      "label": "Policy State",
      "description": "Deploy in report-only mode first to assess impact before enforcing",
      "type": "select",
      "required": true,
      "default": "enabledForReportingButNotEnforced",
      "options": [
        { "value": "enabledForReportingButNotEnforced", "label": "Report-only (Recommended)" },
        { "value": "enabled", "label": "Enforce immediately" },
        { "value": "disabled", "label": "Disabled" }
      ],
      "jsonPaths": ["state"]
    },
    {
      "id": "breakGlassGroup",
      "label": "Break-Glass Exclusion Group",
      "description": "Entra ID Object ID of the security group containing emergency access accounts. Leave empty to skip.",
      "type": "text",
      "required": false,
      "default": "",
      "placeholder": "00000000-0000-0000-0000-000000000000",
      "jsonPaths": ["conditions.users.excludeGroups[0]"]
    }
  ],
  "_dependencies": {
    "recommendsBefore": ["CA02"]
  }
}