{
  "displayName": "CA18 | Block Access from Unsupported Device Platforms",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "excludeGroups": []
    },
    "applications": {
      "includeApplications": [
        "All"
      ]
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "platforms": {
      "includePlatforms": [
        "all"
      ],
      "excludePlatforms": [
        "android",
        "iOS",
        "windows",
        "macOS"
      ]
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ]
  },
  "_metadata": {
    "policyNumber": "CA18",
    "description": "Blocks access from unsupported device platforms by including all platforms and excluding only the approved ones (Android, iOS, Windows, macOS). This effectively blocks Linux, ChromeOS, and any other unrecognised or spoofed platform strings. Ensures only organisationally managed and supported operating systems can access corporate cloud resources.",
    "platformLogic": {
      "includePlatforms": "all - Targets every device platform",
      "excludePlatforms": "android, iOS, windows, macOS - Only these four approved platforms are allowed through",
      "effectivelyBlocked": "Linux, ChromeOS, WindowsPhone, unknown/unrecognised platforms"
    },
    "cisControls": [
      "CIS 5.1.3.1 - Ensure that device code flow is restricted",
      "CIS 5.1.4.3 - Ensure Conditional Access policies are configured to filter for devices"
    ],
    "frameworkMappings": {
      "NIST-800-53": [
        "AC-19",
        "CM-8",
        "CM-7",
        "SC-43"
      ],
      "CIS-Microsoft-365": [
        "5.1.3.1",
        "5.1.4.3"
      ],
      "ISO-27001-2022": [
        "A.8.1 - User endpoint devices",
        "A.8.9 - Configuration management"
      ],
      "MITRE-ATT&CK": [
        "T1078 - Valid Accounts",
        "T1036 - Masquerading"
      ],
      "NIS2": [
        "Article 21(2)(e) - Security in network and information systems acquisition"
      ],
      "Essential-Eight": [
        "Application control",
        "Patch operating systems"
      ]
    },
    "requiredLicenses": [
      "Microsoft Entra ID P1 or P2"
    ],
    "deploymentNotes": "This policy uses the platform include/exclude pattern to block all platforms except the four approved ones. Be aware that platform detection relies on the User-Agent string and can be spoofed in some scenarios. This policy is most effective when combined with CA06 or CA16 which enforce device compliance. Deploy in report-only first and monitor for legitimate users on Linux workstations or ChromeOS devices before enforcing. Replace  with the Object ID of your break-glass exclusion security group."
  },
  "_configFields": [
    {
      "id": "caState",
      "label": "Policy State",
      "description": "Deploy in report-only mode first to assess impact before enforcing",
      "type": "select",
      "required": true,
      "default": "enabledForReportingButNotEnforced",
      "options": [
        { "value": "enabledForReportingButNotEnforced", "label": "Report-only (Recommended)" },
        { "value": "enabled", "label": "Enforce immediately" },
        { "value": "disabled", "label": "Disabled" }
      ],
      "jsonPaths": ["state"]
    },
    {
      "id": "breakGlassGroup",
      "label": "Break-Glass Exclusion Group",
      "description": "Entra ID Object ID of the security group containing emergency access accounts. Leave empty to skip.",
      "type": "text",
      "required": false,
      "default": "",
      "placeholder": "00000000-0000-0000-0000-000000000000",
      "jsonPaths": ["conditions.users.excludeGroups[0]"]
    }
  ]
}