{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "displayName": "INT01 - Windows 10/11 Device Compliance Baseline",
  "description": "Enforces baseline compliance for Windows 10/11 devices: BitLocker, Secure Boot, TPM 2.0, Defender real-time protection with current definitions, firewall, and minimum OS build 10.0.19045 (22H2). Noncompliant devices marked after 3 days, blocked after 7 days.",
  "version": 1,
  "bitLockerEnabled": true,
  "secureBootEnabled": true,
  "codeIntegrityEnabled": true,
  "osMinimumVersion": "10.0.19045",
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "storageRequireEncryption": true,
  "activeFirewallRequired": true,
  "defenderEnabled": true,
  "defenderVersion": null,
  "signatureOutOfDate": false,
  "rtpEnabled": true,
  "antivirusRequired": true,
  "antiSpywareRequired": true,
  "tpmRequired": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "passwordRequired": true,
  "passwordBlockSimple": true,
  "passwordRequiredType": "alphanumeric",
  "passwordMinimumLength": 8,
  "passwordMinutesOfInactivityBeforeLock": 15,
  "passwordExpirationDays": null,
  "passwordMinimumCharacterSetCount": 3,
  "passwordPreviousPasswordBlockCount": 5,
  "requireHealthyDeviceReport": false,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "validOperatingSystemBuildRanges": [],
  "deviceCompliancePolicyScript": null,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 72,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        },
        {
          "actionType": "block",
          "gracePeriodHours": 168,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "roleScopeTagIds": [
    "0"
  ],
  "_metadata": {
    "policyId": "INT01",
    "description": "Windows 10/11 device compliance baseline enforcing BitLocker encryption, Secure Boot, TPM 2.0, Defender real-time protection with current definitions, firewall, and minimum OS build 10.0.19045 (22H2). Devices are marked noncompliant after 3 days (72 hours) and blocked after 7 days (168 hours).",
    "graphEndpoint": "POST /deviceManagement/deviceCompliancePolicies",
    "platform": "Windows 10/11",
    "frameworks": [
      "CIS Microsoft Intune for Windows 11 Benchmark v3.0.1",
      "NIST SP 800-171 Rev 2",
      "NIST SP 800-53 Rev 5 - CM-6, SI-3, SC-28",
      "ISO 27001:2022 A.8.1",
      "Essential Eight - Patch Applications, Configure Microsoft Office Macro Settings",
      "Microsoft Cloud Security Benchmark - DP-4, PV-6"
    ],
    "cisChecks": [
      "CIS 1.1.1 - Ensure BitLocker Drive Encryption is enabled",
      "CIS 1.1.2 - Ensure Secure Boot is enabled",
      "CIS 1.1.3 - Ensure TPM is present and enabled",
      "CIS 2.3.1 - Ensure Windows Defender real-time protection is enabled",
      "CIS 2.3.2 - Ensure antivirus definitions are up to date",
      "CIS 9.1.1 - Ensure Windows Firewall is enabled for all profiles"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
