{
  "@odata.type": "#microsoft.graph.iosManagedAppProtection",
  "displayName": "INT09 - App Protection Policy (MAM) - iOS/Android",
  "description": "Mobile Application Management policy: prevents cut/copy/paste to unmanaged apps, blocks save to personal storage, requires 6-digit numeric PIN, blocks screenshots, enforces minimum OS, wipes after 90 days offline.",
  "version": 1,
  "periodOfflineBeforeAccessCheck": "PT12H",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "allowedInboundDataTransferSources": "managedApps",
  "allowedOutboundDataTransferDestinations": "managedApps",
  "organizationalCredentialsRequired": false,
  "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
  "dataBackupBlocked": true,
  "deviceComplianceRequired": false,
  "managedBrowserToOpenLinksRequired": false,
  "saveAsBlocked": true,
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "pinRequired": true,
  "maximumPinRetries": 5,
  "simplePinBlocked": true,
  "minimumPinLength": 6,
  "pinCharacterSet": "numeric",
  "periodBeforePinReset": "P0D",
  "allowedDataStorageLocations": [
    "oneDriveForBusiness",
    "sharePoint"
  ],
  "contactSyncBlocked": false,
  "printBlocked": true,
  "fingerprintBlocked": false,
  "disableAppPinIfDevicePinIsSet": false,
  "minimumRequiredOsVersion": "16.0",
  "minimumWarningOsVersion": "16.0",
  "minimumRequiredAppVersion": null,
  "minimumWarningAppVersion": null,
  "managedBrowser": "microsoftEdge",
  "minimumRequiredSdkVersion": null,
  "screenCaptureBlocked": true,
  "encryptAppData": true,
  "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
  "appDataEncryptionType": "whenDeviceLocked",
  "faceIdBlocked": false,
  "customBrowserProtocol": null,
  "apps": [
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.Office.Outlook"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.Office.Word"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.Office.Excel"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.Office.Powerpoint"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.onenote"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.msapps"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.skype.teams"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.sharepoint"
      }
    },
    {
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.iosMobileAppIdentifier",
        "bundleId": "com.microsoft.msedge"
      }
    }
  ],
  "_androidPolicy": {
    "@odata.type": "#microsoft.graph.androidManagedAppProtection",
    "displayName": "INT09 - App Protection Policy (MAM) - Android",
    "description": "Android counterpart: same MAM protections applied to Android Enterprise managed apps.",
    "allowedInboundDataTransferSources": "managedApps",
    "allowedOutboundDataTransferDestinations": "managedApps",
    "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
    "dataBackupBlocked": true,
    "saveAsBlocked": true,
    "pinRequired": true,
    "simplePinBlocked": true,
    "minimumPinLength": 6,
    "pinCharacterSet": "numeric",
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "periodOfflineBeforeAccessCheck": "PT12H",
    "screenCaptureBlocked": true,
    "encryptAppData": true,
    "minimumRequiredOsVersion": "13.0",
    "minimumWarningOsVersion": "13.0",
    "allowedDataStorageLocations": [
      "oneDriveForBusiness",
      "sharePoint"
    ],
    "printBlocked": true,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false
  },
  "_metadata": {
    "policyId": "INT09",
    "description": "Mobile Application Management (MAM) policy for iOS and Android. Prevents data leakage via cut/copy/paste to unmanaged apps, blocks save to personal storage, requires 6-digit numeric PIN, blocks screenshots, enforces minimum OS (iOS 16.0 / Android 13.0), and wipes managed app data after 90 days offline. The _androidPolicy section provides the equivalent Android configuration for POST /deviceAppManagement/androidManagedAppProtections.",
    "graphEndpoint": "POST /deviceAppManagement/iosManagedAppProtections",
    "graphEndpointAndroid": "POST /deviceAppManagement/androidManagedAppProtections",
    "platform": "iOS/iPadOS and Android",
    "frameworks": [
      "CIS Microsoft 365 Foundations Benchmark v3.1",
      "NIST SP 800-53 Rev 5 - AC-19, MP-7, SC-28",
      "NIST SP 800-171 Rev 2 - 3.1.18, 3.1.19",
      "ISO 27001:2022 A.8.10",
      "Essential Eight - Restrict Administrative Privileges",
      "HIPAA - 164.312(d)"
    ],
    "cisChecks": [
      "CIS 2.6.1 - Ensure mobile device management is configured",
      "CIS 2.6.2 - Ensure app protection policies prevent data leakage",
      "CIS 2.6.3 - Ensure PIN is required for mobile app access",
      "CIS 2.6.4 - Ensure minimum OS version is enforced"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
