{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "INT05 - BitLocker Drive Encryption Policy",
  "description": "Enforces BitLocker encryption on OS drives (TPM+PIN, XTS-AES 256-bit) and fixed data drives. Recovery keys stored in Azure AD. Compatible TPM startup configuration.",
  "version": 1,
  "bitLockerAllowStandardUserEncryption": true,
  "bitLockerDisableWarningForOtherDiskEncryption": true,
  "bitLockerEnableStorageCardEncryptionOnMobile": false,
  "bitLockerEncryptDevice": true,
  "bitLockerRecoveryPasswordRotation": "enabledForAzureAd",
  "bitLockerSystemDrivePolicy": {
    "encryptionMethod": "xtsAes256",
    "startupAuthenticationRequired": true,
    "startupAuthenticationBlockWithoutTpmChip": true,
    "startupAuthenticationTpmUsage": "required",
    "startupAuthenticationTpmPinUsage": "required",
    "startupAuthenticationTpmKeyUsage": "allowed",
    "startupAuthenticationTpmPinAndKeyUsage": "allowed",
    "prebootRecoveryEnableMessageAndUrl": false,
    "prebootRecoveryMessage": null,
    "prebootRecoveryUrl": null,
    "recoveryOptions": {
      "blockDataRecoveryAgent": false,
      "recoveryPasswordUsage": "allowed",
      "recoveryKeyUsage": "allowed",
      "hideRecoveryOptions": false,
      "enableRecoveryInformationSaveToStore": true,
      "recoveryInformationToStore": "passwordAndKey",
      "enableBitLockerAfterRecoveryInformationToStore": true
    },
    "minimumPinLength": 6
  },
  "bitLockerFixedDrivePolicy": {
    "encryptionMethod": "xtsAes256",
    "requireEncryptionForWriteAccess": true,
    "recoveryOptions": {
      "blockDataRecoveryAgent": false,
      "recoveryPasswordUsage": "allowed",
      "recoveryKeyUsage": "allowed",
      "hideRecoveryOptions": false,
      "enableRecoveryInformationSaveToStore": true,
      "recoveryInformationToStore": "passwordAndKey",
      "enableBitLockerAfterRecoveryInformationToStore": true
    }
  },
  "bitLockerRemovableDrivePolicy": {
    "encryptionMethod": "aes256",
    "requireEncryptionForWriteAccess": true,
    "blockCrossOrganizationWriteAccess": false
  },
  "roleScopeTagIds": [
    "0"
  ],
  "_metadata": {
    "policyId": "INT05",
    "description": "BitLocker encryption policy requiring XTS-AES 256-bit encryption on OS and fixed data drives. OS drive requires TPM+PIN startup authentication. Recovery keys automatically escrowed to Azure AD. Fixed drives require encryption for write access.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11",
    "frameworks": [
      "CIS Microsoft Intune for Windows 11 Benchmark v3.0.1",
      "NIST SP 800-53 Rev 5 - SC-28(1)",
      "NIST SP 800-171 Rev 2 - 3.13.11",
      "ISO 27001:2022 A.8.24",
      "PCI DSS v4.0 - Req 3.4",
      "Essential Eight - Restrict Administrative Privileges",
      "HIPAA - 164.312(a)(2)(iv)"
    ],
    "cisChecks": [
      "CIS 1.1.1 - Ensure BitLocker Drive Encryption is enabled on OS drive",
      "CIS 1.1.2 - Ensure BitLocker encryption method is XTS-AES 256-bit",
      "CIS 1.1.3 - Ensure BitLocker recovery information is saved to Azure AD",
      "CIS 1.1.4 - Ensure fixed data drives require BitLocker encryption"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
