{
  "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
  "displayName": "INT06 - Windows LAPS Local Admin Password Solution",
  "description": "Configures Windows LAPS to automatically rotate local administrator passwords. Passwords backed up to Azure AD, rotated every 30 days, 14-character complexity with upper, lower, numbers, and special characters.",
  "version": 1,
  "omaSettings": [
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "BackupDirectory - Azure AD",
      "description": "Configure backup directory for LAPS passwords. 1 = Azure AD.",
      "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/BackupDirectory",
      "value": 1
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "PasswordAgeDays",
      "description": "Maximum password age in days before rotation.",
      "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/PasswordAgeDays",
      "value": 30
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "PasswordComplexity",
      "description": "Password complexity: 4 = Large letters + small letters + numbers + special characters.",
      "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/PasswordComplexity",
      "value": 4
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "PasswordLength",
      "description": "Length of generated password.",
      "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/PasswordLength",
      "value": 14
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingString",
      "displayName": "AdministratorAccountName",
      "description": "Name of the local administrator account managed by LAPS.",
      "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/AdministratorAccountName",
      "value": "LocalAdmin"
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "PostAuthenticationResetDelay",
      "description": "Hours to wait after authentication before resetting the password. 0 = disabled.",
      "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/PostAuthenticationResetDelay",
      "value": 24
    },
    {
      "@odata.type": "#microsoft.graph.omaSettingInteger",
      "displayName": "PostAuthenticationActions",
      "description": "Actions after authentication: 3 = Reset password and logoff managed account.",
      "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/PostAuthenticationActions",
      "value": 3
    }
  ],
  "roleScopeTagIds": [
    "0"
  ],
  "_metadata": {
    "policyId": "INT06",
    "description": "Windows LAPS (Local Administrator Password Solution) policy deploying automatic local admin password rotation via Azure AD backup. Passwords are 14 characters with full complexity, rotated every 30 days, with post-authentication reset after 24 hours.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11",
    "omaUriBase": "./Device/Vendor/MSFT/LAPS/Policies/",
    "frameworks": [
      "CIS Microsoft Intune for Windows 11 Benchmark v3.0.1",
      "NIST SP 800-53 Rev 5 - AC-2, IA-5",
      "NIST SP 800-171 Rev 2 - 3.5.7, 3.5.8",
      "ISO 27001:2022 A.5.17",
      "Essential Eight - Restrict Administrative Privileges",
      "MITRE ATT&CK - T1078.003 (Local Accounts)"
    ],
    "cisChecks": [
      "CIS 1.1.5 - Ensure LAPS is configured to manage local admin passwords",
      "CIS 1.1.6 - Ensure LAPS password complexity meets requirements",
      "CIS 1.1.7 - Ensure LAPS password age is 30 days or less"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
