{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "INT19 - Windows Exploit Protection (System-Wide Mitigations)",
  "description": "Enables system-wide exploit mitigations: DEP always on, SEHOP enabled, mandatory ASLR, Control Flow Guard (CFG) enabled. Hardens all processes against memory exploitation techniques.",
  "version": 1,
  "defenderExploitProtectionXml": null,
  "defenderExploitProtectionXmlFileName": null,
  "roleScopeTagIds": [
    "0"
  ],
  "_exploitProtectionXml": {
    "description": "The exploit protection XML below should be Base64-encoded and set as defenderExploitProtectionXml value, or deployed via the Exploit Protection settings in Endpoint Security. The XML configures system-wide mitigations for all processes.",
    "xmlContent": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<MitigationPolicy>\n  <SystemConfig>\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\n    <ControlFlowGuard Enable=\"true\" SuppressExports=\"false\" />\n    <Heap TerminateOnError=\"true\" />\n    <ImageLoad BlockRemoteImageLoads=\"false\" BlockLowLabelImageLoads=\"false\" />\n  </SystemConfig>\n  <AppConfig Executable=\"iexplore.exe\">\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\n  </AppConfig>\n  <AppConfig Executable=\"OUTLOOK.EXE\">\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\n  </AppConfig>\n  <AppConfig Executable=\"WINWORD.EXE\">\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\n  </AppConfig>\n  <AppConfig Executable=\"EXCEL.EXE\">\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\n  </AppConfig>\n  <AppConfig Executable=\"POWERPNT.EXE\">\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\n    <ExtensionPoints DisableExtensionPoints=\"true\" />\n  </AppConfig>\n  <AppConfig Executable=\"msedge.exe\">\n    <DEP Enable=\"true\" EmulateAtlThunks=\"false\" />\n    <ASLR ForceRelocateImages=\"true\" RequireInfo=\"false\" BottomUp=\"true\" HighEntropy=\"true\" />\n    <SEHOP Enable=\"true\" TelemetryOnly=\"false\" />\n  </AppConfig>\n</MitigationPolicy>"
  },
  "_omaUriSettings": {
    "description": "OMA-URI settings for deploying exploit protection XML and system-level mitigations.",
    "settings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Exploit Protection XML",
        "description": "Deploy exploit protection XML configuration. The value should be the Base64-encoded XML from _exploitProtectionXml.",
        "omaUri": "./Device/Vendor/MSFT/Policy/Config/ExploitGuard/ExploitProtectionSettings",
        "value": "BASE64_ENCODED_XML_HERE"
      }
    ]
  },
  "_metadata": {
    "policyId": "INT19",
    "description": "Windows Exploit Protection policy enabling system-wide memory mitigations: Data Execution Prevention (DEP) always on, Structured Exception Handler Overwrite Protection (SEHOP), mandatory Address Space Layout Randomization (ASLR) with high entropy, Control Flow Guard (CFG), and heap termination on corruption. Includes per-application hardening for Office apps (Outlook, Word, Excel, PowerPoint), Internet Explorer, and Edge. Deploy the XML via defenderExploitProtectionXml (Base64-encoded) or via OMA-URI.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11",
    "frameworks": [
      "CIS Microsoft Windows 11 Enterprise Benchmark v3.0.0",
      "NIST SP 800-53 Rev 5 - SI-16, SC-39",
      "NIST SP 800-171 Rev 2 - 3.14.2",
      "ISO 27001:2022 A.8.6",
      "Essential Eight - Application Control",
      "MITRE ATT&CK - T1203 (Exploitation for Client Execution), T1068 (Exploitation for Privilege Escalation)"
    ],
    "cisChecks": [
      "CIS 18.9.47.1 - Ensure DEP is enabled for all processes",
      "CIS 18.9.47.2 - Ensure SEHOP is enabled",
      "CIS 18.9.47.3 - Ensure mandatory ASLR is enabled",
      "CIS 18.9.47.4 - Ensure Control Flow Guard is enabled"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
