{
  "@odata.type": "#microsoft.graph.windowsIdentityProtectionConfiguration",
  "displayName": "INT13 - Windows Hello for Business Configuration",
  "description": "Enables Windows Hello for Business for all users: PIN required (min 6, max 127 digits), biometric allowed, TPM required, PIN recovery enabled. Phishing-resistant passwordless authentication.",
  "version": 1,
  "useSecurityKeyForSignin": true,
  "enhancedAntiSpoofingForFacialFeaturesEnabled": true,
  "pinMinimumLength": 6,
  "pinMaximumLength": 127,
  "pinUppercaseCharactersUsage": "allowed",
  "pinLowercaseCharactersUsage": "allowed",
  "pinSpecialCharactersUsage": "allowed",
  "pinExpirationInDays": 0,
  "pinPreviousBlockCount": 0,
  "pinRecoveryEnabled": true,
  "securityDeviceRequired": true,
  "unlockWithBiometricsEnabled": true,
  "useCertificatesForOnPremisesAuthEnabled": false,
  "windowsHelloForBusinessBlocked": false,
  "roleScopeTagIds": [
    "0"
  ],
  "_metadata": {
    "policyId": "INT13",
    "description": "Windows Hello for Business configuration enabling phishing-resistant passwordless authentication. Requires TPM-backed PIN (minimum 6 digits, maximum 127), allows biometric unlock with enhanced anti-spoofing, enables PIN recovery, and supports FIDO2 security key sign-in. Deploys to all Windows 10/11 devices.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11",
    "frameworks": [
      "CIS Microsoft Intune for Windows 11 Benchmark v3.0.1",
      "NIST SP 800-53 Rev 5 - IA-2, IA-5, IA-12",
      "NIST SP 800-63B - AAL2",
      "NIST SP 800-171 Rev 2 - 3.5.3",
      "ISO 27001:2022 A.8.5",
      "Essential Eight - Multi-Factor Authentication",
      "MITRE ATT&CK - T1110 (Brute Force), T1078 (Valid Accounts)"
    ],
    "cisChecks": [
      "CIS 5.2.2.2 - Ensure Windows Hello for Business is enabled",
      "CIS 5.3.1 - Ensure PIN minimum length is 6 or greater",
      "CIS 5.3.2 - Ensure biometric authentication is allowed",
      "CIS 5.3.3 - Ensure TPM is required for Windows Hello"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
