{
  "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
  "displayName": "INT04 - macOS Device Compliance Baseline",
  "description": "Enforces baseline compliance for macOS devices: minimum OS 14.0, FileVault encryption required, Gatekeeper enabled, System Integrity Protection enabled, passcode required (min 6), firewall enabled.",
  "version": 1,
  "passwordRequired": true,
  "passwordBlockSimple": true,
  "passwordExpirationDays": null,
  "passwordMinimumLength": 6,
  "passwordMinutesOfInactivityBeforeLock": 15,
  "passwordPreviousPasswordBlockCount": 5,
  "passwordMinimumCharacterSetCount": 1,
  "passwordRequiredType": "alphanumeric",
  "osMinimumVersion": "14.0",
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "systemIntegrityProtectionEnabled": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "storageRequireEncryption": true,
  "gatekeeperAllowedAppSource": "macAppStoreAndIdentifiedDevelopers",
  "firewallEnabled": true,
  "firewallBlockAllIncoming": false,
  "firewallEnableStealthMode": false,
  "scheduledActionsForRule": [
    {
      "ruleName": "PasswordRequired",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 72,
          "notificationTemplateId": "",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "roleScopeTagIds": [
    "0"
  ],
  "_metadata": {
    "policyId": "INT04",
    "description": "macOS compliance baseline requiring minimum OS 14.0 (Sonoma), FileVault disk encryption, Gatekeeper app source restriction, System Integrity Protection, alphanumeric passcode (min 6), and firewall enabled.",
    "graphEndpoint": "POST /deviceManagement/deviceCompliancePolicies",
    "platform": "macOS",
    "frameworks": [
      "CIS Apple macOS Benchmark v3.0",
      "NIST SP 800-53 Rev 5 - AC-7, IA-5, SC-28, SI-7",
      "ISO 27001:2022 A.8.1",
      "Essential Eight - Patch Operating Systems",
      "Microsoft Cloud Security Benchmark - DP-4, ES-1"
    ],
    "cisChecks": [
      "CIS 2.5.1.1 - Ensure FileVault is enabled",
      "CIS 2.6.1.1 - Ensure Gatekeeper is enabled",
      "CIS 2.6.1.2 - Ensure System Integrity Protection is enabled",
      "CIS 2.6.4 - Ensure Firewall is enabled",
      "CIS 5.2.1 - Ensure password is required to wake from sleep or screen saver",
      "CIS 5.2.3 - Ensure complex password is required"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
