{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "INT14 - Windows Firewall Policy (All Profiles)",
  "description": "Enforces Windows Firewall on all profiles (Domain, Private, Public): block inbound on public, allow outbound, enable logging of dropped packets.",
  "version": 1,
  "firewallProfileDomain": {
    "firewallEnabled": "allowed",
    "stealthModeRequired": false,
    "stealthModeBlocked": false,
    "incomingTrafficRequired": false,
    "incomingTrafficBlocked": false,
    "unicastResponsesToMulticastBroadcastsRequired": false,
    "unicastResponsesToMulticastBroadcastsBlocked": false,
    "inboundNotificationsRequired": false,
    "inboundNotificationsBlocked": false,
    "authorizedApplicationRulesFromGroupPolicyMerged": true,
    "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
    "globalPortRulesFromGroupPolicyMerged": true,
    "globalPortRulesFromGroupPolicyNotMerged": false,
    "connectionSecurityRulesFromGroupPolicyMerged": true,
    "connectionSecurityRulesFromGroupPolicyNotMerged": false,
    "outboundConnectionsRequired": false,
    "outboundConnectionsBlocked": false,
    "inboundConnectionsRequired": false,
    "inboundConnectionsBlocked": false,
    "securedPacketExemptionAllowed": false,
    "securedPacketExemptionBlocked": false,
    "policyRulesFromGroupPolicyMerged": true,
    "policyRulesFromGroupPolicyNotMerged": false
  },
  "firewallProfilePrivate": {
    "firewallEnabled": "allowed",
    "stealthModeRequired": false,
    "stealthModeBlocked": false,
    "incomingTrafficRequired": false,
    "incomingTrafficBlocked": false,
    "unicastResponsesToMulticastBroadcastsRequired": false,
    "unicastResponsesToMulticastBroadcastsBlocked": false,
    "inboundNotificationsRequired": false,
    "inboundNotificationsBlocked": false,
    "authorizedApplicationRulesFromGroupPolicyMerged": true,
    "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
    "globalPortRulesFromGroupPolicyMerged": true,
    "globalPortRulesFromGroupPolicyNotMerged": false,
    "connectionSecurityRulesFromGroupPolicyMerged": true,
    "connectionSecurityRulesFromGroupPolicyNotMerged": false,
    "outboundConnectionsRequired": false,
    "outboundConnectionsBlocked": false,
    "inboundConnectionsRequired": false,
    "inboundConnectionsBlocked": false,
    "securedPacketExemptionAllowed": false,
    "securedPacketExemptionBlocked": false,
    "policyRulesFromGroupPolicyMerged": true,
    "policyRulesFromGroupPolicyNotMerged": false
  },
  "firewallProfilePublic": {
    "firewallEnabled": "allowed",
    "stealthModeRequired": true,
    "stealthModeBlocked": false,
    "incomingTrafficRequired": false,
    "incomingTrafficBlocked": true,
    "unicastResponsesToMulticastBroadcastsRequired": false,
    "unicastResponsesToMulticastBroadcastsBlocked": true,
    "inboundNotificationsRequired": false,
    "inboundNotificationsBlocked": true,
    "authorizedApplicationRulesFromGroupPolicyMerged": false,
    "authorizedApplicationRulesFromGroupPolicyNotMerged": true,
    "globalPortRulesFromGroupPolicyMerged": false,
    "globalPortRulesFromGroupPolicyNotMerged": true,
    "connectionSecurityRulesFromGroupPolicyMerged": false,
    "connectionSecurityRulesFromGroupPolicyNotMerged": true,
    "outboundConnectionsRequired": false,
    "outboundConnectionsBlocked": false,
    "inboundConnectionsRequired": false,
    "inboundConnectionsBlocked": true,
    "securedPacketExemptionAllowed": false,
    "securedPacketExemptionBlocked": true,
    "policyRulesFromGroupPolicyMerged": false,
    "policyRulesFromGroupPolicyNotMerged": true
  },
  "firewallBlockAllIncoming": false,
  "firewallIPSecExemptionsNone": false,
  "firewallIPSecExemptionsAllowNeighborDiscovery": true,
  "firewallIPSecExemptionsAllowICMP": false,
  "firewallIPSecExemptionsAllowRouterDiscovery": true,
  "firewallIPSecExemptionsAllowDHCP": true,
  "firewallMergeKeyingModuleSettings": false,
  "firewallPacketQueueingMethod": "deviceDefault",
  "firewallPreSharedKeyEncodingMethod": "deviceDefault",
  "firewallCertificateRevocationListCheckMethod": "deviceDefault",
  "_firewallLogging": {
    "description": "Firewall logging settings to be deployed via OMA-URI custom configuration profile for dropped packet logging.",
    "omaSettings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Domain Profile - Log Dropped Packets",
        "omaUri": "./Vendor/MSFT/Firewall/MdmStore/DomainProfile/EnableLogDroppedPackets",
        "value": "true"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Domain Profile - Log File Size",
        "omaUri": "./Vendor/MSFT/Firewall/MdmStore/DomainProfile/LogMaxFileSize",
        "value": 16384
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Private Profile - Log Dropped Packets",
        "omaUri": "./Vendor/MSFT/Firewall/MdmStore/PrivateProfile/EnableLogDroppedPackets",
        "value": "true"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Private Profile - Log File Size",
        "omaUri": "./Vendor/MSFT/Firewall/MdmStore/PrivateProfile/LogMaxFileSize",
        "value": 16384
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Public Profile - Log Dropped Packets",
        "omaUri": "./Vendor/MSFT/Firewall/MdmStore/PublicProfile/EnableLogDroppedPackets",
        "value": "true"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Public Profile - Log File Size",
        "omaUri": "./Vendor/MSFT/Firewall/MdmStore/PublicProfile/LogMaxFileSize",
        "value": 16384
      }
    ]
  },
  "roleScopeTagIds": [
    "0"
  ],
  "_metadata": {
    "policyId": "INT14",
    "description": "Windows Firewall policy enabling all three profiles (Domain, Private, Public). Public profile blocks all inbound connections and enables stealth mode. All profiles allow outbound. Dropped packet logging enabled at 16 MB per profile via supplementary OMA-URI settings in _firewallLogging.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11",
    "frameworks": [
      "CIS Microsoft Windows 11 Enterprise Benchmark v3.0.0",
      "NIST SP 800-53 Rev 5 - SC-7, AU-3",
      "NIST SP 800-171 Rev 2 - 3.13.1, 3.13.6",
      "ISO 27001:2022 A.8.20, A.8.21",
      "Essential Eight - Patch Operating Systems",
      "Microsoft Cloud Security Benchmark - NS-1, NS-4"
    ],
    "cisChecks": [
      "CIS 9.1.1 - Ensure Windows Firewall: Domain: Firewall state is On",
      "CIS 9.2.1 - Ensure Windows Firewall: Private: Firewall state is On",
      "CIS 9.3.1 - Ensure Windows Firewall: Public: Firewall state is On",
      "CIS 9.3.2 - Ensure Windows Firewall: Public: Inbound connections is Block",
      "CIS 9.1.5 - Ensure Windows Firewall: Domain: Logging: Log dropped packets is enabled",
      "CIS 9.2.5 - Ensure Windows Firewall: Private: Logging: Log dropped packets is enabled",
      "CIS 9.3.5 - Ensure Windows Firewall: Public: Logging: Log dropped packets is enabled"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
