{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "INT20 - Controlled Folder Access (Ransomware Protection)",
  "description": "Enables Controlled Folder Access in Block mode to protect Documents, Desktop, Pictures, and Videos folders from unauthorised modifications. Provides ransomware protection by blocking untrusted app access to protected folders.",
  "version": 1,
  "defenderGuardMyFoldersType": "enable",
  "defenderGuardedFoldersAllowedAppPaths": [],
  "defenderAdditionalGuardedFolders": [
    "C:\\Users\\*\\Documents",
    "C:\\Users\\*\\Desktop",
    "C:\\Users\\*\\Pictures",
    "C:\\Users\\*\\Videos",
    "C:\\Users\\*\\Music",
    "C:\\Users\\*\\Favorites"
  ],
  "defenderNetworkProtectionType": "enable",
  "defenderAdvancedRansomewareProtectionType": "enable",
  "defenderPotentiallyUnwantedAppAction": "block",
  "defenderRealTimeMonitorAllowed": true,
  "roleScopeTagIds": [
    "0"
  ],
  "_omaUriSettings": {
    "description": "OMA-URI settings for granular Controlled Folder Access configuration.",
    "settings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Enable Controlled Folder Access",
        "description": "EnableControlledFolderAccess: 1 = Enabled (Block mode). Use 2 for Audit mode.",
        "omaUri": "./Vendor/MSFT/Policy/Config/Defender/EnableControlledFolderAccess",
        "value": 1
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Controlled Folder Access Protected Folders",
        "description": "Additional folders to protect beyond the default system folders.",
        "omaUri": "./Vendor/MSFT/Policy/Config/Defender/ControlledFolderAccessProtectedFolders",
        "value": "C:\\Users\\Public\\Documents|C:\\Shares"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Controlled Folder Access Allowed Applications",
        "description": "Applications allowed to access protected folders. Add trusted LOB applications here.",
        "omaUri": "./Vendor/MSFT/Policy/Config/Defender/ControlledFolderAccessAllowedApplications",
        "value": ""
      }
    ]
  },
  "_metadata": {
    "policyId": "INT20",
    "description": "Controlled Folder Access policy in Block mode providing ransomware protection for user profile folders (Documents, Desktop, Pictures, Videos, Music, Favorites) and optional additional paths. Only trusted applications (automatically determined by Microsoft Defender) can modify files in protected folders. Untrusted applications are blocked from writing to protected locations. IMPORTANT: Deploy in Audit mode (defenderGuardMyFoldersType=auditMode, OMA-URI value=2) for at least 2 weeks before enabling Block mode to identify legitimate applications that need allow-listing.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11",
    "prerequisite": "Microsoft Defender for Endpoint Plan 1 or above. Cloud-delivered protection must be enabled. Test in Audit mode for 2 weeks before Block mode.",
    "frameworks": [
      "CIS Microsoft Windows 11 Enterprise Benchmark v3.0.0",
      "NIST SP 800-53 Rev 5 - SI-3, SI-4, SC-7",
      "NIST SP 800-171 Rev 2 - 3.14.2",
      "ISO 27001:2022 A.8.7",
      "Essential Eight - Application Control",
      "MITRE ATT&CK - T1486 (Data Encrypted for Impact), T1490 (Inhibit System Recovery)"
    ],
    "cisChecks": [
      "CIS 18.9.47.5.3.1 - Ensure Controlled Folder Access is enabled",
      "CIS 18.9.47.5.3.2 - Ensure protected folders are configured",
      "CIS 18.9.47.5.3.3 - Ensure allowed applications list is reviewed"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  },
  "_dependencies": {
    "recommendsBefore": ["INT15"]
  }
}
