{
  "displayName": "CA02 | Require MFA for All Users",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "excludeGroups": []
    },
    "applications": {
      "includeApplications": [
        "All"
      ]
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ]
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ]
  },
  "_metadata": {
    "policyNumber": "CA02",
    "description": "Requires multi-factor authentication for all users across all cloud applications. This is the foundational MFA policy and the single most effective control against identity compromise, blocking over 99.9% of account compromise attacks.",
    "cisControls": [
      "CIS 1.3.1 - Ensure MFA is required for all users in all cloud apps",
      "CIS 5.2.2.2 - Ensure multifactor authentication is enabled for all users in administrative roles",
      "CIS 5.3.1 - Ensure the Microsoft Authenticator app is configured to protect against MFA fatigue"
    ],
    "frameworkMappings": {
      "NIST-800-53": [
        "IA-2(1)",
        "IA-2(2)",
        "IA-2(6)"
      ],
      "CIS-Microsoft-365": [
        "1.3.1",
        "5.2.2.2",
        "5.3.1"
      ],
      "ISO-27001-2022": [
        "A.8.5 - Secure authentication"
      ],
      "MITRE-ATT&CK": [
        "T1078 - Valid Accounts",
        "T1556 - Modify Authentication Process"
      ],
      "NIS2": [
        "Article 21(2)(j) - Multi-factor authentication"
      ],
      "Essential-Eight": [
        "Multi-factor authentication"
      ],
      "SOC-2": [
        "CC6.1 - Logical and physical access controls"
      ]
    },
    "requiredLicenses": [
      "Microsoft Entra ID P1 or P2"
    ],
    "deploymentNotes": "Deploy in report-only first. Ensure all users have registered at least one MFA method via https://aka.ms/mfasetup before enforcing. Review the Authentication methods activity report in Entra admin centre. Replace  with the Object ID of your break-glass exclusion security group."
  }
}