{
  "displayName": "CA05 | Require Password Change for High-Risk Users",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "excludeGroups": []
    },
    "applications": {
      "includeApplications": [
        "All"
      ]
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "userRiskLevels": [
      "high"
    ]
  },
  "grantControls": {
    "operator": "AND",
    "builtInControls": [
      "mfa",
      "passwordChange"
    ]
  },
  "_metadata": {
    "policyNumber": "CA05",
    "description": "Requires both MFA verification and a secure password change when Microsoft Entra ID Identity Protection classifies a user account as high risk. High-risk users are those with confirmed compromised credentials detected via dark web intelligence, leaked credential databases, or confirmed malicious sign-in activity patterns.",
    "cisControls": [
      "CIS 1.2.2 - Ensure that a user risk policy is configured to block high-risk users",
      "CIS 5.2.2.6 - Ensure user risk policy is configured to require MFA or password change for high user risk"
    ],
    "frameworkMappings": {
      "NIST-800-53": [
        "IA-5(1)",
        "IA-5(13)",
        "AC-7",
        "IR-4"
      ],
      "CIS-Microsoft-365": [
        "1.2.2",
        "5.2.2.6"
      ],
      "ISO-27001-2022": [
        "A.5.7 - Threat intelligence",
        "A.8.5 - Secure authentication"
      ],
      "MITRE-ATT&CK": [
        "T1078 - Valid Accounts",
        "T1110.001 - Password Guessing",
        "T1552 - Unsecured Credentials"
      ],
      "NIS2": [
        "Article 21(2)(b) - Incident handling"
      ],
      "Essential-Eight": [
        "Multi-factor authentication"
      ]
    },
    "requiredLicenses": [
      "Microsoft Entra ID P2 or Microsoft 365 E5"
    ],
    "deploymentNotes": "Requires Entra ID P2 licensing. For hybrid environments, password writeback must be enabled in Microsoft Entra Connect so that cloud-initiated password changes synchronise back to on-premises Active Directory. The AND operator ensures BOTH MFA and password change are required simultaneously. Deploy in report-only first. Replace  with the Object ID of your break-glass exclusion security group."
  }
}