{
  "displayName": "CA17 | Require MFA for Medium-Risk Sign-Ins",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "excludeGroups": []
    },
    "applications": {
      "includeApplications": [
        "All"
      ]
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "signInRiskLevels": [
      "medium"
    ]
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ]
  },
  "_metadata": {
    "policyNumber": "CA17",
    "description": "Requires MFA step-up verification for sign-in attempts classified as medium risk by Microsoft Entra ID Identity Protection. Unlike CA04 which blocks high-risk sign-ins entirely, this policy allows medium-risk sign-ins to proceed after MFA verification, balancing security with usability. Medium-risk detections include atypical travel, anomalous token, and suspicious browser patterns.",
    "cisControls": [
      "CIS 1.3.3 - Ensure that a sign-in risk policy requires MFA for medium or high-risk",
      "CIS 5.2.2.5 - Ensure Sign-in risk policy is configured to require MFA for medium and high sign-in risk"
    ],
    "frameworkMappings": {
      "NIST-800-53": [
        "SI-4",
        "AC-7",
        "IA-2(1)",
        "IA-5(13)"
      ],
      "CIS-Microsoft-365": [
        "1.3.3",
        "5.2.2.5"
      ],
      "ISO-27001-2022": [
        "A.8.16 - Monitoring activities",
        "A.8.5 - Secure authentication"
      ],
      "MITRE-ATT&CK": [
        "T1078 - Valid Accounts",
        "T1110 - Brute Force",
        "T1550 - Use Alternate Authentication Material"
      ],
      "NIS2": [
        "Article 21(2)(b) - Incident handling",
        "Article 21(2)(j) - Multi-factor authentication"
      ],
      "Essential-Eight": [
        "Multi-factor authentication"
      ]
    },
    "requiredLicenses": [
      "Microsoft Entra ID P2 or Microsoft 365 E5"
    ],
    "deploymentNotes": "Requires Entra ID P2 for Identity Protection risk detection. This policy complements CA04 (block high-risk) by providing a less disruptive response to medium-risk sign-ins. The MFA requirement auto-remediates the risk level upon successful completion. Deploy in report-only first and review the Risky sign-ins report for medium-risk detection patterns. Replace  with the Object ID of your break-glass exclusion security group."
  }
}