{
  "_metadata": {
    "id": "SPO13",
    "title": "Restrict External Sharing to Allowed Domains Only",
    "description": "Limits external sharing to a specific allowlist of approved partner domains. Only users from the specified domains can receive sharing invitations or access shared content. This prevents data leakage to unauthorised external organisations while maintaining controlled collaboration with approved partners.",
    "frameworks": [
      "NIS2",
      "ISO 27001:2022",
      "NIST SP 800-53 Rev 5",
      "GDPR (EU) 2016/679",
      "SOC 2",
      "PCI DSS v4.0",
      "HIPAA",
      "FedRAMP Moderate",
      "DORA",
      "CMMC v2.0",
      "HITRUST CSF v11",
      "ASD Essential Eight",
      "UK NCSC CAF v3.2",
      "Microsoft Cloud Security Benchmark",
      "NYDFS 23 NYCRR 500"
    ],
    "cisChecks": ["7.2.3", "7.2.5", "7.2.7", "7.2.9"],
    "severity": "High",
    "category": "SharePoint Online",
    "deploymentOrder": 13,
    "requiredLicence": "SharePoint Online (included with Microsoft 365)",
    "version": "1.0",
    "lastUpdated": "2026-02-28",
    "_notes": "Replace partner1.com and partner2.com with your actual allowed partner domains. The SharingAllowedDomainList is a space-separated list of domain names. AllowList mode means ONLY the listed domains can receive external shares; all other domains are blocked. Review and update the domain list regularly as partner relationships change. This setting applies tenant-wide; individual site collections can further restrict but not expand the allowed domains."
  },
  "cmdlet": "Set-SPOTenant",
  "parameters": {
    "SharingDomainRestrictionMode": "AllowList",
    "SharingAllowedDomainList": "partner1.com partner2.com"
  },
  "postDeployment": [
    "Get-SPOTenant | Select-Object SharingDomainRestrictionMode, SharingAllowedDomainList",
    "Test sharing a document with a user from an allowed domain to confirm it succeeds",
    "Test sharing a document with a user from a non-listed domain to confirm it is blocked",
    "Review existing external shares for domains not on the allowlist: Get-SPOExternalUser -PageSize 50 | Select-Object DisplayName, Email, AcceptedAs | Where-Object {$_.Email -notmatch 'partner1.com|partner2.com'}",
    "Communicate to users that external sharing is now restricted to approved partner domains only",
    "Establish a process for requesting additions to the allowed domain list through your IT governance workflow"
  ]
}