{
  "_metadata": {
    "id": "MDE04",
    "title": "Enable EDR in Block Mode",
    "description": "Enables EDR in Block Mode so that Microsoft Defender for Endpoint can block malicious artefacts even when a third-party antivirus is the primary protection engine. This provides a post-breach behavioural blocking layer on top of the existing AV.",
    "version": "1.0",
    "lastUpdated": "2026-02-27",
    "frameworks": [
      "NIS2",
      "DORA",
      "ISO 27001:2022",
      "NIST SP 800-53 Rev.5",
      "UK NCSC CAF v3.2",
      "SOC 2",
      "FedRAMP Moderate",
      "HITRUST CSF v11",
      "BSI IT-Grundschutz",
      "ASD Essential Eight",
      "MITRE ATT&CK",
      "Microsoft Cloud Security Benchmark",
      "NIST CSF 2.0",
      "CMMC v2.0",
      "PCI DSS v4.0",
      "HIPAA"
    ],
    "cisChecks": [
      "5.1.4.1",
      "5.1.4.2"
    ],
    "mitreMappings": [
      "T1059",
      "T1055",
      "T1053",
      "T1547",
      "T1574"
    ],
    "requiredLicences": [
      "Microsoft Defender for Endpoint P2",
      "Microsoft 365 E5 or Microsoft 365 E5 Security"
    ],
    "requiredRoles": [
      "Security Administrator",
      "Intune Administrator"
    ],
    "deploymentOrder": 4,
    "importMethod": "powershell-graph",
    "importScript": "scripts/Import-DefenderEndpointPolicies.ps1"
  },
  "_notes": {
    "prerequisites": [
      "Devices must be onboarded to Microsoft Defender for Endpoint (MDE01 must be deployed first)",
      "MDE P2 licence is required for EDR in Block Mode",
      "Cloud-delivered protection must be enabled for EDR Block Mode to function",
      "Works alongside third-party AV products; does NOT require Microsoft Defender Antivirus as primary AV",
      "When Defender AV is primary, this setting is not needed as Defender already blocks in real-time"
    ],
    "deploymentSteps": [
      "1. Verify devices are onboarded to MDE via MDE01",
      "2. Deploy this Intune endpoint security profile to enable EDR Block Mode",
      "3. Alternatively, use the PowerShell command via a remediation script",
      "4. Monitor for false positives in security.microsoft.com > Incidents for 2 weeks",
      "5. Review blocked items under security.microsoft.com > Action center"
    ],
    "rollbackProcedure": "Set EnableEDRBlockMode to Disabled via PowerShell or remove the Intune profile assignment."
  },
  "_configFields": [
    {
      "id": "deviceGroupId",
      "label": "Target Device Group ID",
      "description": "The Entra ID (Azure AD) group object ID for Windows devices to enable EDR Block Mode on. Found in Entra admin center > Groups.",
      "type": "text",
      "required": true,
      "default": "",
      "placeholder": "e.g. 12345678-abcd-1234-abcd-1234567890ab",
      "jsonPaths": [
        "assignments.include[0].groupId"
      ]
    },
    {
      "id": "excludeGroupId",
      "label": "Exclusion Group ID",
      "description": "Optional Entra ID group object ID for devices to exclude (e.g. sensitive servers requiring manual remediation).",
      "type": "text",
      "required": false,
      "default": "",
      "placeholder": "e.g. 12345678-abcd-1234-abcd-1234567890ab",
      "jsonPaths": [
        "assignments.exclude[0].groupId"
      ]
    }
  ],
  "intuneEndpointSecurityPolicy": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
    "name": "MDE04 - EDR in Block Mode",
    "description": "Enable EDR in Block Mode for post-breach behavioural blocking even with third-party AV installed",
    "platforms": "windows10",
    "technologies": "mdm,microsoftSense",
    "templateReference": {
      "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
      "templateFamily": "endpointSecurityEndpointDetectionAndResponse",
      "templateDisplayName": "Endpoint detection and response",
      "templateDisplayVersion": "Version 2"
    },
    "settings": [
      {
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_edrinblockmode",
          "choiceSettingValue": {
            "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_edrinblockmode_enabled",
            "children": []
          }
        }
      }
    ]
  },
  "powershellDeployment": {
    "description": "Alternative deployment via PowerShell remediation script or GPO",
    "command": "Set-MpPreference -EnableEDRBlockMode Enabled",
    "verificationCommand": "Get-MpPreference | Select-Object -Property EnableEDRBlockMode",
    "expectedResult": "EnableEDRBlockMode: Enabled",
    "remediationScript": {
      "displayName": "MDE04 - Enable EDR Block Mode Remediation",
      "description": "Proactive remediation to ensure EDR Block Mode is enabled",
      "detectionScript": "$edrMode = (Get-MpPreference).EnableEDRBlockMode; if ($edrMode -eq 'Enabled' -or $edrMode -eq $true) { Write-Output 'Compliant'; exit 0 } else { Write-Output 'Non-compliant'; exit 1 }",
      "remediationScript": "Set-MpPreference -EnableEDRBlockMode Enabled; Write-Output 'EDR Block Mode enabled'; exit 0",
      "runAs": "system",
      "runAs32Bit": false,
      "scheduleFrequency": "daily"
    }
  },
  "omaUriAlternative": {
    "_description": "OMA-URI deployment via Intune custom configuration profile",
    "omaUri": "./Vendor/MSFT/Defender/Configuration/PassiveRemediation",
    "dataType": "Integer",
    "value": 1,
    "_valueDescription": "1 = Enable EDR in Block Mode, 0 = Disable"
  },
  "assignments": {
    "include": [
      {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "groupId": "",
        "groupDisplayName": "All Managed Windows Devices"
      }
    ],
    "exclude": [
      {
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
        "groupId": "",
        "groupDisplayName": "Sensitive Servers - Manual Remediation Only"
      }
    ]
  },
  "_dependencies": {
    "requires": ["MDE01"]
  }
}