{
  "_metadata": {
    "id": "GOV03",
    "title": "Block Persistent Browser Sessions on Unmanaged Devices",
    "description": "Prevents persistent browser sessions on unmanaged devices to reduce the risk of credential theft via shared or public computers.",
    "frameworks": ["CIS Microsoft 365 v3.1.0", "NIST SP 800-53 Rev 5", "NIS2", "ISO 27001:2022", "SOC 2", "PCI DSS v4.0", "HIPAA", "FedRAMP Moderate", "CMMC v2.0", "DORA"],
    "cisChecks": ["5.1.2.2"],
    "severity": "High",
    "category": "Identity Governance",
    "deploymentOrder": 3,
    "requiredLicence": "Entra ID P1 or P2",
    "version": "1.0",
    "lastUpdated": "2026-03-10"
  },
  "displayName": "GOV03 | Non-persistent Browser on Unmanaged Devices",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": { "includeUsers": ["All"] },
    "applications": { "includeApplications": ["All"] },
    "clientAppTypes": ["browser"],
    "devices": {
      "deviceFilter": {
        "mode": "include",
        "rule": "device.isCompliant -ne True -and device.trustType -ne 'ServerAD'"
      }
    }
  },
  "sessionControls": {
    "persistentBrowser": { "isEnabled": true, "mode": "never" },
    "signInFrequency": { "isEnabled": true, "value": 4, "type": "hours" }
  },
  "postDeployment": [
    "Test from an unmanaged device and verify session expires as configured",
    "Review Conditional Access insights in Report-Only mode for 7 days",
    "Ensure Intune-enrolled devices are not impacted by the device filter"
  ]
}
