{
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "displayName": "INT08 - Windows Update for Business Ring Policy",
  "description": "Windows Update ring: quality update deferral 7 days, feature update deferral 30 days, auto-install at maintenance time, active hours 8:00-17:00, deadline compliance enabled.",
  "version": 1,
  "deliveryOptimizationMode": "httpWithPeeringNat",
  "prereleaseFeatures": "userDefined",
  "automaticUpdateMode": "autoInstallAtMaintenanceTime",
  "microsoftUpdateServiceAllowed": true,
  "driversExcluded": false,
  "qualityUpdatesDeferralPeriodInDays": 7,
  "featureUpdatesDeferralPeriodInDays": 30,
  "qualityUpdatesPaused": false,
  "featureUpdatesPaused": false,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "businessReadyUpdatesOnly": "businessReadyOnly",
  "skipChecksBeforeRestart": false,
  "updateWeeks": null,
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursStart": "08:00:00.0000000",
    "activeHoursEnd": "17:00:00.0000000"
  },
  "userPauseAccess": "enabled",
  "userWindowsUpdateScanAccess": "enabled",
  "updateNotificationLevel": "defaultNotifications",
  "allowWindows11Upgrade": true,
  "autoRestartNotificationDismissal": "notConfigured",
  "scheduleRestartWarningInHours": 4,
  "scheduleImminentRestartWarningInMinutes": 15,
  "engagedRestartDeadlineInDays": 7,
  "engagedRestartSnoozeScheduleInDays": 1,
  "engagedRestartTransitionScheduleInDays": 2,
  "deadlineForFeatureUpdatesInDays": 14,
  "deadlineForQualityUpdatesInDays": 7,
  "deadlineGracePeriodInDays": 2,
  "postponeRebootUntilAfterDeadline": false,
  "roleScopeTagIds": [
    "0"
  ],
  "_metadata": {
    "policyId": "INT08",
    "description": "Windows Update for Business ring policy deferring quality updates by 7 days and feature updates by 30 days. Auto-installs during maintenance time with active hours 08:00-17:00. Engaged restart after deadline with grace period. Drivers included, Microsoft Update service enabled.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11",
    "frameworks": [
      "CIS Microsoft Intune for Windows 11 Benchmark v3.0.1",
      "NIST SP 800-53 Rev 5 - SI-2, CM-3",
      "NIST SP 800-171 Rev 2 - 3.14.1",
      "ISO 27001:2022 A.8.8",
      "Essential Eight - Patch Operating Systems (Maturity Level 2)",
      "Microsoft Cloud Security Benchmark - PV-6, PV-7"
    ],
    "cisChecks": [
      "CIS 18.9.102.1 - Ensure quality update deferral is configured",
      "CIS 18.9.102.2 - Ensure feature update deferral is configured",
      "CIS 18.9.102.3 - Ensure automatic updates are enabled",
      "CIS 18.9.102.4 - Ensure active hours are configured"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
