{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "displayName": "INT16 - Windows Credential Guard and Device Guard",
  "description": "Enables Credential Guard with UEFI lock to protect domain credentials via virtualisation-based security (VBS). Enables Device Guard for code integrity. Mitigates pass-the-hash and pass-the-ticket attacks.",
  "version": 1,
  "deviceGuardLocalSystemAuthorityCredentialGuardSettings": "enableWithUEFILock",
  "deviceGuardEnableVirtualizationBasedSecurity": true,
  "deviceGuardEnableSecureBootWithDMA": true,
  "deviceGuardSecureBootWithDMA": "withoutDMA",
  "deviceGuardLaunchSystemGuard": "enabled",
  "dmaGuardDeviceEnumerationPolicy": "blockAll",
  "xboxServicesEnableXboxGameSaveTask": false,
  "xboxServicesAccessoryManagementServiceStartupMode": "disabled",
  "xboxServicesLiveAuthManagerServiceStartupMode": "disabled",
  "xboxServicesLiveGameSaveServiceStartupMode": "disabled",
  "xboxServicesLiveNetworkingServiceStartupMode": "disabled",
  "roleScopeTagIds": [
    "0"
  ],
  "_supplementaryOmaUri": {
    "description": "Additional Credential Guard and VBS settings via OMA-URI for comprehensive deployment.",
    "settings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Enable Virtualization Based Security",
        "description": "RequirePlatformSecurityFeatures: 3 = Secure Boot and DMA Protection.",
        "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceGuard/RequirePlatformSecurityFeatures",
        "value": 3
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Credential Guard Configuration",
        "description": "LsaCfgFlags: 1 = Enabled with UEFI lock.",
        "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceGuard/LsaCfgFlags",
        "value": 1
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Enable Virtualization Based Security",
        "description": "EnableVirtualizationBasedSecurity: 1 = Enabled.",
        "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceGuard/EnableVirtualizationBasedSecurity",
        "value": 1
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Hypervisor Enforced Code Integrity",
        "description": "HypervisorEnforcedCodeIntegrity: 1 = Enabled with UEFI lock.",
        "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceGuard/HypervisorEnforcedCodeIntegrity",
        "value": 1
      }
    ]
  },
  "_metadata": {
    "policyId": "INT16",
    "description": "Enables Windows Credential Guard with UEFI lock to isolate domain credentials (NTLM hashes, Kerberos TGTs) in a virtualization-based security (VBS) container. Enables Device Guard with Hypervisor-enforced Code Integrity (HVCI). Blocks DMA attacks via DMA Guard. Requires hardware supporting UEFI Secure Boot and VBS. WARNING: UEFI lock means Credential Guard cannot be disabled remotely - only via physical UEFI/BIOS access.",
    "graphEndpoint": "POST /deviceManagement/deviceConfigurations",
    "platform": "Windows 10/11 Enterprise/Education",
    "prerequisite": "Requires UEFI Secure Boot, VBS-capable hardware, TPM 2.0. Windows Enterprise or Education edition. Test on pilot devices first. UEFI lock is persistent.",
    "frameworks": [
      "CIS Microsoft Windows 11 Enterprise Benchmark v3.0.0",
      "NIST SP 800-53 Rev 5 - AC-25, SC-39",
      "NIST SP 800-171 Rev 2 - 3.13.4",
      "ISO 27001:2022 A.8.6",
      "Essential Eight - Restrict Administrative Privileges",
      "MITRE ATT&CK - T1003.001 (LSASS Memory), T1550 (Use Alternate Authentication Material)"
    ],
    "cisChecks": [
      "CIS 18.8.5.1 - Ensure Turn On Virtualization Based Security is Enabled",
      "CIS 18.8.5.2 - Ensure Turn On Virtualization Based Security: Credential Guard Configuration is Enabled with UEFI lock",
      "CIS 18.8.5.3 - Ensure Turn On Virtualization Based Security: Require Platform Security Features is Secure Boot and DMA Protection"
    ],
    "version": "1.0.0",
    "lastUpdated": "2026-02-27"
  }
}
