{
  "_metadata": {
    "id": "SPO06",
    "title": "Enable Entra ID B2B Integration",
    "description": "Enables SharePoint and OneDrive integration with Entra ID (Azure AD) B2B. When enabled, all external sharing creates Entra ID guest accounts, making external users subject to Conditional Access policies, access reviews, and centralized identity governance.",
    "frameworks": [
      "CIS Microsoft 365 v3.1.0",
      "NIST SP 800-53 Rev 5",
      "NIS2",
      "DORA",
      "ISO 27001:2022",
      "UK NCSC CAF v3.2",
      "SOC 2",
      "PCI DSS v4.0",
      "HIPAA",
      "FedRAMP Moderate",
      "GDPR (EU) 2016/679",
      "CMMC v2.0",
      "HITRUST CSF v11",
      "ASD Essential Eight",
      "NYDFS 23 NYCRR 500",
      "FFIEC-CAT",
      "Microsoft Cloud Security Benchmark"
    ],
    "cisChecks": ["7.2.1"],
    "severity": "High",
    "category": "SharePoint Online",
    "deploymentOrder": 6,
    "requiredLicence": "SharePoint Online (included with Microsoft 365) + Entra ID P1 for Conditional Access enforcement",
    "version": "2.0",
    "lastUpdated": "2026-02-27",
    "_notes": "Without B2B integration, SharePoint uses its own ad-hoc sharing mechanism which does not create Entra ID guest accounts. This means external users bypass Conditional Access policies, MFA requirements, and access reviews. Enabling B2B integration ensures all external access is governed by your Entra ID security policies. IMPORTANT: This is a one-way setting. Once enabled, it cannot be disabled via PowerShell; you must contact Microsoft Support to revert. Existing ad-hoc external users will be migrated to Entra ID B2B guest accounts."
  },
  "cmdlet": "Set-SPOTenant",
  "parameters": {
    "EnableAzureADB2BIntegration": true
  },
  "postDeployment": [
    "Get-SPOTenant | Select-Object EnableAzureADB2BIntegration",
    "IMPORTANT: This setting is ONE-WAY. Once enabled, it cannot be disabled without contacting Microsoft Support.",
    "Verify external users now appear as Guest accounts in Entra ID: Get-AzureADUser -Filter \"userType eq 'Guest'\"",
    "Configure Conditional Access policies to apply to guest users (e.g., require MFA for guests)",
    "Set up Entra ID Access Reviews for guest accounts to ensure regular review of external access",
    "Existing ad-hoc external users will be converted to B2B guest accounts automatically"
  ]
}
