{
  "_metadata": {
    "id": "SPO09",
    "title": "Enable Modern Authentication for SharePoint Online",
    "description": "Disables legacy authentication protocols for SharePoint Online by setting LegacyAuthProtocolsEnabled to false. This forces all SharePoint Online connections to use Modern Authentication (OAuth 2.0), which supports MFA, Conditional Access, and token-based authentication.",
    "frameworks": [
      "CIS Microsoft 365 v3.1.0",
      "NIST SP 800-53 Rev 5",
      "NIS2",
      "DORA",
      "ISO 27001:2022",
      "UK NCSC CAF v3.2",
      "SOC 2",
      "PCI DSS v4.0",
      "HIPAA",
      "FedRAMP Moderate",
      "GDPR (EU) 2016/679",
      "CMMC v2.0",
      "HITRUST CSF v11",
      "NYDFS 23 NYCRR 500",
      "FFIEC-CAT",
      "ASD Essential Eight",
      "Microsoft Cloud Security Benchmark",
      "MITRE ATT&CK T1078"
    ],
    "cisChecks": ["7.3.1"],
    "severity": "Critical",
    "category": "SharePoint Online",
    "deploymentOrder": 9,
    "requiredLicence": "SharePoint Online (included with Microsoft 365)",
    "version": "2.0",
    "lastUpdated": "2026-02-27",
    "_notes": "Legacy authentication protocols transmit credentials without MFA support and bypass Conditional Access policies. Setting LegacyAuthProtocolsEnabled to false blocks legacy auth for SharePoint Online. IMPORTANT: Ensure all clients (Office desktop, mobile apps, third-party apps) support modern auth before disabling legacy auth. Office 2013 requires a registry key to enable modern auth. Office 2016+ supports modern auth natively. Some automated scripts using SharePoint CSOM may need to be updated to use modern auth patterns."
  },
  "cmdlet": "Set-SPOTenant",
  "parameters": {
    "LegacyAuthProtocolsEnabled": false
  },
  "postDeployment": [
    "Get-SPOTenant | Select-Object LegacyAuthProtocolsEnabled",
    "Audit legacy auth usage before deployment: Review Entra ID sign-in logs filtered by clientApp != 'Browser' and clientApp != 'Mobile Apps and Desktop clients'",
    "Ensure Office 2016 or later is deployed to all workstations",
    "For Office 2013: Enable modern auth via registry key HKCU\\Software\\Microsoft\\Office\\15.0\\Common\\Identity\\EnableADAL = 1",
    "Update any automated scripts or third-party apps that use SharePoint CSOM to use modern auth (MSAL library)",
    "Monitor Entra ID sign-in logs for legacy auth failures after deployment"
  ]
}
