{
  "_metadata": {
    "id": "SPO05",
    "title": "Disable Infected File Download",
    "description": "Prevents users from downloading files that have been flagged as infected by Microsoft Defender for Office 365 in SharePoint Online and OneDrive for Business. Users will see a warning that the file is infected and cannot download it.",
    "frameworks": [
      "CIS Microsoft 365 v3.1.0",
      "NIST SP 800-53 Rev 5",
      "NIS2",
      "DORA",
      "ISO 27001:2022",
      "UK NCSC CAF v3.2",
      "SOC 2",
      "PCI DSS v4.0",
      "HIPAA",
      "FedRAMP Moderate",
      "GDPR (EU) 2016/679",
      "CMMC v2.0",
      "HITRUST CSF v11",
      "ASD Essential Eight",
      "Microsoft Cloud Security Benchmark",
      "MITRE ATT&CK T1080"
    ],
    "cisChecks": ["7.2.8"],
    "severity": "High",
    "category": "SharePoint Online",
    "deploymentOrder": 5,
    "requiredLicence": "SharePoint Online (included with Microsoft 365). Defender for Office 365 enhances scanning.",
    "version": "2.0",
    "lastUpdated": "2026-02-27",
    "_notes": "By default, SharePoint Online allows users to download files flagged as infected (with a warning). This setting blocks the download entirely. Files are scanned asynchronously after upload; there may be a brief window before scanning completes. This works with both EOP (basic) and Defender for Office 365 (advanced) scanning. DEF07 (EnableATPForSPOTeamsODB) should be enabled for enhanced scanning capabilities."
  },
  "cmdlet": "Set-SPOTenant",
  "parameters": {
    "DisallowInfectedFileDownload": true
  },
  "postDeployment": [
    "Get-SPOTenant | Select-Object DisallowInfectedFileDownload",
    "Verify DEF07 (Defender for SharePoint, OneDrive, Teams) is also enabled for enhanced malware scanning",
    "Test by uploading an EICAR test file to a SharePoint document library and attempting to download it after scanning completes",
    "Note: Scanning is asynchronous; newly uploaded files may be downloadable for a brief period before scanning completes",
    "Admins can still access infected files via SharePoint admin tools if needed for investigation"
  ]
}
