{
  "displayName": "CA07 | Block Sign-Ins from Non-Approved Countries",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "excludeGroups": []
    },
    "applications": {
      "includeApplications": [
        "All"
      ]
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "locations": {
      "includeLocations": [
        "All"
      ],
      "excludeLocations": [
        "AllTrusted"
      ]
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ]
  },
  "_metadata": {
    "policyNumber": "CA07",
    "description": "Blocks all sign-in attempts originating from countries not included in the approved Named Location. This is a geo-fencing control that significantly reduces the attack surface by preventing authentication from regions where the organisation has no legitimate users or operations.",
    "prerequisiteSteps": [
      "1. Navigate to Entra admin centre > Protection > Conditional Access > Named locations",
      "2. Click '+ Countries location'",
      "3. Name it 'AllowedCountries' (or your preferred name)",
      "4. Select the countries where your organisation operates",
      "5. Mark as 'trusted location' if appropriate",
      "6. Save and copy the resulting Location ID",
      "7. Replace AllTrusted in this policy with that ID"
    ],
    "cisControls": [
      "CIS 1.3.9 - Ensure that a Conditional Access policy is configured to block access from anonymous or threat-intelligence flagged IP addresses"
    ],
    "frameworkMappings": {
      "NIST-800-53": [
        "AC-2(11)",
        "SC-7",
        "SI-4"
      ],
      "CIS-Microsoft-365": [
        "1.3.9"
      ],
      "ISO-27001-2022": [
        "A.8.20 - Networks security",
        "A.8.22 - Segregation of networks"
      ],
      "MITRE-ATT&CK": [
        "T1078 - Valid Accounts",
        "T1090 - Proxy",
        "T1090.003 - Multi-hop Proxy"
      ],
      "NIS2": [
        "Article 21(2)(b) - Incident handling"
      ],
      "Essential-Eight": [
        "Multi-factor authentication"
      ]
    },
    "requiredLicenses": [
      "Microsoft Entra ID P1 or P2"
    ],
    "deploymentNotes": "IMPORTANT: You MUST create the Named Location in Entra admin centre BEFORE importing this policy, then replace AllTrusted with the actual GUID. If you import with the placeholder the API call will fail. Deploy in report-only first and monitor for legitimate users travelling or using VPN endpoints in blocked countries. Replace  with the Object ID of your break-glass exclusion security group."
  },
  "_configFields": [
    {
      "id": "caState",
      "label": "Policy State",
      "description": "Deploy in report-only mode first to assess impact before enforcing",
      "type": "select",
      "required": true,
      "default": "enabledForReportingButNotEnforced",
      "options": [
        { "value": "enabledForReportingButNotEnforced", "label": "Report-only (Recommended)" },
        { "value": "enabled", "label": "Enforce immediately" },
        { "value": "disabled", "label": "Disabled" }
      ],
      "jsonPaths": ["state"]
    },
    {
      "id": "breakGlassGroup",
      "label": "Break-Glass Exclusion Group",
      "description": "Entra ID Object ID of the security group containing emergency access accounts. Leave empty to skip.",
      "type": "text",
      "required": false,
      "default": "",
      "placeholder": "00000000-0000-0000-0000-000000000000",
      "jsonPaths": ["conditions.users.excludeGroups[0]"]
    }
  ]
}